In [24]:
cd ..

/content

In [39]:
cat ./data/CSV_EX_3.csv

Bedroom; Sq. foot; Locality; Price ($)
2; 1500; Good; 300000
3; 1300; Fair; 240000
3; 1900; Very good; 450000
3; 1850; Bad; 280000
2; 1640; Good; 310000

In [21]:
import pandas as pd

# Reading from a CSV file

Default case

In [25]:
df1 = pd.read_csv("./data/CSV_EX_1.csv")

In [26]:
df1

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

Missing headers

In [33]:
df2 = pd.read_csv("./data/CSV_EX_2.csv", header=None)

In [34]:
df2

   0     1           2       3
0  2  1500        Good  300000
1  3  1300        Fair  240000
2  3  1900   Very good  450000
3  3  1850         Bad  280000
4  2  1640        Good  310000

Custom column headers

In [37]:
df2 = pd.read_csv("./data/CSV_EX_2.csv", names=['Bedroom','Sq. foot', 'Locality','Price ($)'])

In [38]:
df2

   Bedroom  Sq. foot    Locality  Price ($)
0        2      1500        Good     300000
1        3      1300        Fair     240000
2        3      1900   Very good     450000
3        3      1850         Bad     280000
4        2      1640        Good     310000

Non-default separators

In [44]:
df3 = pd.read_csv("./data/CSV_EX_3.csv",sep=';')

In [45]:
df3

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

Skip rows

In [52]:
df5 = pd.read_csv('./data/CSV_EX_skiprows.csv', skiprows=2)

In [53]:
df5

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

Skip footers

In [55]:
df6 = pd.read_csv('./data/CSV_EX_skipfooter.csv', skiprows=2, skipfooter=1)
df6

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000
3        3       1850         Bad      280000
4        2       1640        Good      310000

Read only first 'n' rows

In [57]:
df7 = pd.read_csv('./data/CSV_EX_1.csv', nrows=3)
df7

   Bedroom   Sq. foot    Locality   Price ($)
0        2       1500        Good      300000
1        3       1300        Fair      240000
2        3       1900   Very good      450000

Reading in chunks (skip + nrows)

In [ ]:
list_of_dataframes = []
rows_in_a_chunk = 10
num_chunks = 5
df_dummy = pd.read_csv('./data/Boston_housing.csv', nrows=2)
col_names = df_dummy.columns
for i in range(0, num_chunks*rows_in_a_chunk):
  df = pd.read_csv('./data/Boston_housing.csv', header=0, skiprows=2) #TODO
  list_of_dataframes.append(df)

In [ ]:
list_of_dataframes[0]